# Dasha Davis Ch. 17 - SQL Practice

In [2]:
import sqlite3

connection = sqlite3.connect('books.db')

In [3]:
import pandas as pd

In [4]:
pd.options.display.max_columns = 10

In [5]:
pd.read_sql('SELECT * FROM authors', connection,
            index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [6]:
#use SQL and pandas to view the titles (table) table of contents

In [7]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [8]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection
                 
de.head()

SyntaxError: invalid syntax (2917292453.py, line 3)

In [9]:
#typo - try again

In [10]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection

In [11]:
df.head()

NameError: name 'df' is not defined

In [12]:
#missed an ending parenthesis

In [13]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection)

df.head()

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673

# Dasha Davis 17.2.3 Where clause

In [14]:
pd.read_sql("""SELECT title, edition, copyright
               FROM titles
               WHERE copyright > '2016'""", connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

In [15]:
# Pattern Matching: Zero or More Characters

In [16]:
pd.read_sql("""SELECT id, first, last
               FROM authors
               WHERE last like 'D%'""",
            connection, index_col=['id']

SyntaxError: unexpected EOF while parsing (2253134076.py, line 4)

In [17]:
# Oh, I missed an ending parenthesis

In [18]:
pd.read_sql("""SELECT id, first, last
               FROM authors
               WHERE last like 'D%'""",
            connection, index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

In [19]:
#pattern matching: any character, p. 735

In [20]:
pd.read_sql("""SELECT id, first, last
               FROM authors
               WHERE first LIKE '_b%'""",
            connection, index_col=['id'])

    first    last
id
3   Abbey  Deitel

## Dasha Davis 17.2.4 ORDER BY clause

In [21]:
#sorts results in either ascending or descending order - ascending is default

In [22]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC',
            connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [23]:
#sorting by multiple columns

In [24]:
pd.read_sql("""SELECT id, first, last
               FROM authors
               ORDER BY last, first""",
            connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [25]:
#sorting can vary by column too

In [26]:
pd.read_sql("""SELECT id, first, last
               FROM authors
               ORDER BY last DESC, first ASC""",
            connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

In [27]:
#combining the WHERE and ORDER BY clauses

In [28]:
pd.read_sql("""SELECT isbn, title, edition, copyright
               FROM titles
               WHERE title LIKE '%How to Program'
               ORDER BY title""", connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

## Dasha Davis

## 17.2.5 Merging Data from multiple tables: INNER JOIN

In [29]:
pd.read_sql("""SELECT first, last, isbn
               FROM authors
               INNER JOIN author_ISBN
                   ON authors.id = author_ISBN.id
               ORDER BY last, first""", connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

In [30]:
#authors.id syntax - (table_name.column_name)

In [31]:
#this is a 'qualified name' syntax that specifies the fields from multiple tables that should be compared to join the tables.

In [32]:
#17.2.6 INSERT INTO Statement

In [15]:
cursor = connection.cursor()

In [16]:
cursor = cursor.execute("""INSERT INTO authors (first, last)
                           VALUES ('Sue', 'Red')""")

In [17]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

In [36]:
## 17.2.7 UPDATE statement

In [37]:
#update statement modifies existing values

In [18]:
cursor = cursor.execute("""UPDATE authors SET last='Black'
                           WHERE last='Red' AND first='Sue'""")

In [39]:
# above code updates Sue's last name to Black instead of Red

In [19]:
cursor.rowcount #confirms that UPDATE modified one row.

1

In [6]:
import sqlite3

In [7]:
connection = sqlite3.connect('books.db')

In [8]:
import pandas as pd

In [20]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black

In [24]:
# 17.2.8 DELETE FROM statement (removes rows from table)

In [28]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

In [29]:
cursor.rowcount

0

In [30]:
#I had to go back, and I've already deleted this row. My notebook didn't save the tail end of my practice.

In [31]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

# Dasha Davis Self-Check 17.2

In [32]:
pd.read_sql("""SELECT title, edition FROM titles
               ORDER BY edition DESC""", connection).head(3)

                 title  edition
0  Java How to Program       11
1   C++ How to Program       10
2     C How to Program        8

In [35]:
pd.read_sql("""SELECT * FROM authors
               WHERE first LIKE 'A%'""", connection)

   id      first    last
0   3      Abbey  Deitel
1   5  Alexander    Wald

In [36]:
pd.read_sql("""SELECT isbn, title, edition, copyright
               FROM titles
               WHERE title NOT LIKE '%How to Program'
               ORDER BY title""", connection)

         isbn                          title  edition copyright
0  0134289366      Android 6 for Programmers        3      2016
1  0135404673  Intro to Python for CS and DS        1      2020